starter_turbulence_model_change/periodic_hill_sa/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<vector> 
99
(
(-1.320988207e-05 0 0)
(-1.296432527e-05 0 0)
(-1.273017784e-05 -1.590428599e-22 0)
(-1.250667817e-05 0 0)
(-1.229312967e-05 -1.535821362e-22 0)
(-1.208889365e-05 0 0)
(-1.189338306e-05 0 0)
(-1.170605792e-05 0 0)
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<vector> 
99
(
(-0.008195055179 -1.726967503e-22 0)
(-0.008409096342 -0.0001942522058 5.519529336e-24)
(-0.00893875864 -0.000692352709 -1.620938754e-22)
(-0.01012786851 -0.001266487559 9.640515805e-22)
(-0.01115403797 -0.001568689228 -0)
(-0.01153154349 -0.001659093164 -1.444044784e-21)
(-0.0113794517 -0.001642235595 -0)
(-0.01084358223 -0.001564932739 9.316955352e-22)
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
