starter_turbulence_model_change/periodic_hill_sa/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
8.636172424
8.753352214
8.869981887
8.986089089
9.10169932
9.216836315
9.33152238
9.445778215
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.3093026737
0.3055871265
0.2990900846
0.2873637206
0.2789787365
0.2771674323
0.2802576338
0.2871237936
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
