starter_turbulence_model_change/periodic_hill_sa/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  10                                    |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

// Geometry and velocity conventions follow the published case_1p0 benchmark:
// h = 1, Lx/h = 9, Ly/h = 3.036, Ubar = 0.020188, Ub = Ubar/0.721 = 0.028.
h               [0 1 0 0 0 0 0] 1;
Ub              [0 1 -1 0 0 0 0] 0.028;
nu              [0 2 -1 0 0 0 0] 5.0e-06;

// ************************************************************************* //
