starter_turbulence_model_change/periodic_hill_sa/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters    0.0357142857142857;
vertices
(
	( 0	28	0 )	// vertex number 0
	( 54	0	0 )	// vertex number 1
	( 54	85	0 )	// vertex number 2
	( 0	85	0 )	// vertex number 3
	( 0	28	126 )	// vertex number 4
	( 54	0	126 )	// vertex number 5
	( 54	85	126 )	// vertex number 6
	( 0	85	126 )	// vertex number 7
	( 198	85	0 )	// vertex number 8
	( 198	85	126 )	// vertex number 9
	( 198	0	126 )	// vertex number 10
	( 198	0	0 )	// vertex number 11
	( 252	85	0 )	// vertex number 12
	( 252	85	126 )	// vertex number 13
	( 252	28	126 )	// vertex number 14
	( 252	28	0 )	// vertex number 15
	( 0	56.5	0 )	// vertex number 16
	( 54	42.5	0 )	// vertex number 17
	( 54	42.5	126 )	// vertex number 18
	( 0	56.5	126 )	// vertex number 19
	( 198	42.5	0 )	// vertex number 20
	( 198	42.5	126 )	// vertex number 21
	( 252	56.5	0 )	// vertex number 22
	( 252	56.5	126 )	// vertex number 23
);

edges
(
	spline 0 1 
(
(  0.10 28.00000 0.0 )
(  0.60 28.00000 0.0 )
(  1.10 28.00000 0.0 )
(  1.60 28.00000 0.0 )
(  2.10 28.00000 0.0 )
(  2.60 28.00000 0.0 )
(  3.10 28.00000 0.0 )
(  3.60 27.98868 0.0 )
(  4.10 27.96746 0.0 )
(  4.60 27.93657 0.0 )
(  5.10 27.89440 0.0 )
(  5.60 27.83937 0.0 )
(  6.10 27.76987 0.0 )
(  6.60 27.68433 0.0 )
(  7.10 27.58114 0.0 )
(  7.60 27.45871 0.0 )
(  8.10 27.31545 0.0 )
(  8.60 27.14977 0.0 )
(  9.10 26.96007 0.0 )
(  9.60 26.74561 0.0 )
( 10.10 26.50756 0.0 )
( 10.60 26.24734 0.0 )
( 11.10 25.96636 0.0 )
( 11.60 25.66604 0.0 )
( 12.10 25.34780 0.0 )
( 12.60 25.01305 0.0 )
( 13.10 24.66321 0.0 )
( 13.60 24.29970 0.0 )
( 14.10 23.92394 0.0 )
( 14.60 23.53728 0.0 )
( 15.10 23.14096 0.0 )
( 15.60 22.73621 0.0 )
( 16.10 22.32425 0.0 )
( 16.60 21.90628 0.0 )
( 17.10 21.48354 0.0 )
( 17.60 21.05725 0.0 )
( 18.10 20.62861 0.0 )
( 18.60 20.19886 0.0 )
( 19.10 19.76921 0.0 )
( 19.60 19.34089 0.0 )
( 20.10 18.91510 0.0 )
( 20.60 18.49269 0.0 )
( 21.10 18.07361 0.0 )
( 21.60 17.65770 0.0 )
( 22.10 17.24482 0.0 )
( 22.60 16.83480 0.0 )
( 23.10 16.42749 0.0 )
( 23.60 16.02274 0.0 )
( 24.10 15.62039 0.0 )
( 24.60 15.22029 0.0 )
( 25.10 14.82227 0.0 )
( 25.60 14.42619 0.0 )
( 26.10 14.03189 0.0 )
( 26.60 13.63921 0.0 )
( 27.10 13.24800 0.0 )
( 27.60 12.85811 0.0 )
( 28.10 12.46937 0.0 )
( 28.60 12.08164 0.0 )
( 29.10 11.69475 0.0 )
( 29.60 11.30856 0.0 )
( 30.10 10.92291 0.0 )
( 30.60 10.53781 0.0 )
( 31.10 10.15370 0.0 )
( 31.60  9.77103 0.0 )
( 32.10  9.39028 0.0 )
( 32.60  9.01192 0.0 )
( 33.10  8.63643 0.0 )
( 33.60  8.26426 0.0 )
( 34.10  7.89590 0.0 )
( 34.60  7.53181 0.0 )
( 35.10  7.17247 0.0 )
( 35.60  6.81834 0.0 )
( 36.10  6.46990 0.0 )
( 36.60  6.12762 0.0 )
( 37.10  5.79196 0.0 )
( 37.60  5.46341 0.0 )
( 38.10  5.14242 0.0 )
( 38.60  4.82947 0.0 )
( 39.10  4.52503 0.0 )
( 39.60  4.22958 0.0 )
( 40.10  3.94357 0.0 )
( 40.60  3.66737 0.0 )
( 41.10  3.40101 0.0 )
( 41.60  3.14453 0.0 )
( 42.10  2.89795 0.0 )
( 42.60  2.66128 0.0 )
( 43.10  2.43454 0.0 )
( 43.60  2.21776 0.0 )
( 44.10  2.01095 0.0 )
( 44.60  1.81413 0.0 )
( 45.10  1.62733 0.0 )
( 45.60  1.45056 0.0 )
( 46.10  1.28385 0.0 )
( 46.60  1.12721 0.0 )
( 47.10  0.98067 0.0 )
( 47.60  0.84424 0.0 )
( 48.10  0.71794 0.0 )
( 48.60  0.60180 0.0 )
( 49.10  0.49584 0.0 )
( 49.60  0.40007 0.0 )
( 50.10  0.31451 0.0 )
( 50.60  0.23919 0.0 )
( 51.10  0.17412 0.0 )
( 51.60  0.11933 0.0 )
( 52.10  0.07483 0.0 )
( 52.60  0.04065 0.0 )
( 53.10  0.01681 0.0 )
( 53.60  0.00332 0.0 )
( 53.90  0.00020 0.0 )
)
	spline 4 5 
(
(  0.10 28.00000 126.0 )
(  0.60 28.00000 126.0 )
(  1.10 28.00000 126.0 )
(  1.60 28.00000 126.0 )
(  2.10 28.00000 126.0 )
(  2.60 28.00000 126.0 )
(  3.10 28.00000 126.0 )
(  3.60 27.98868 126.0 )
(  4.10 27.96746 126.0 )
(  4.60 27.93657 126.0 )
(  5.10 27.89440 126.0 )
(  5.60 27.83937 126.0 )
(  6.10 27.76987 126.0 )
(  6.60 27.68433 126.0 )
(  7.10 27.58114 126.0 )
(  7.60 27.45871 126.0 )
(  8.10 27.31545 126.0 )
(  8.60 27.14977 126.0 )
(  9.10 26.96007 126.0 )
(  9.60 26.74561 126.0 )
( 10.10 26.50756 126.0 )
( 10.60 26.24734 126.0 )
( 11.10 25.96636 126.0 )
( 11.60 25.66604 126.0 )
( 12.10 25.34780 126.0 )
( 12.60 25.01305 126.0 )
( 13.10 24.66321 126.0 )
( 13.60 24.29970 126.0 )
( 14.10 23.92394 126.0 )
( 14.60 23.53728 126.0 )
( 15.10 23.14096 126.0 )
( 15.60 22.73621 126.0 )
( 16.10 22.32425 126.0 )
( 16.60 21.90628 126.0 )
( 17.10 21.48354 126.0 )
( 17.60 21.05725 126.0 )
( 18.10 20.62861 126.0 )
( 18.60 20.19886 126.0 )
( 19.10 19.76921 126.0 )
( 19.60 19.34089 126.0 )
( 20.10 18.91510 126.0 )
( 20.60 18.49269 126.0 )
( 21.10 18.07361 126.0 )
( 21.60 17.65770 126.0 )
( 22.10 17.24482 126.0 )
( 22.60 16.83480 126.0 )
( 23.10 16.42749 126.0 )
( 23.60 16.02274 126.0 )
( 24.10 15.62039 126.0 )
( 24.60 15.22029 126.0 )
( 25.10 14.82227 126.0 )
( 25.60 14.42619 126.0 )
( 26.10 14.03189 126.0 )
( 26.60 13.63921 126.0 )
( 27.10 13.24800 126.0 )
( 27.60 12.85811 126.0 )
( 28.10 12.46937 126.0 )
( 28.60 12.08164 126.0 )
( 29.10 11.69475 126.0 )
( 29.60 11.30856 126.0 )
( 30.10 10.92291 126.0 )
( 30.60 10.53781 126.0 )
( 31.10 10.15370 126.0 )
( 31.60  9.77103 126.0 )
( 32.10  9.39028 126.0 )
( 32.60  9.01192 126.0 )
( 33.10  8.63643 126.0 )
( 33.60  8.26426 126.0 )
( 34.10  7.89590 126.0 )
( 34.60  7.53181 126.0 )
( 35.10  7.17247 126.0 )
( 35.60  6.81834 126.0 )
( 36.10  6.46990 126.0 )
( 36.60  6.12762 126.0 )
( 37.10  5.79196 126.0 )
( 37.60  5.46341 126.0 )
( 38.10  5.14242 126.0 )
( 38.60  4.82947 126.0 )
( 39.10  4.52503 126.0 )
( 39.60  4.22958 126.0 )
( 40.10  3.94357 126.0 )
( 40.60  3.66737 126.0 )
( 41.10  3.40101 126.0 )
( 41.60  3.14453 126.0 )
( 42.10  2.89795 126.0 )
( 42.60  2.66128 126.0 )
( 43.10  2.43454 126.0 )
( 43.60  2.21776 126.0 )
( 44.10  2.01095 126.0 )
( 44.60  1.81413 126.0 )
( 45.10  1.62733 126.0 )
( 45.60  1.45056 126.0 )
( 46.10  1.28385 126.0 )
( 46.60  1.12721 126.0 )
( 47.10  0.98067 126.0 )
( 47.60  0.84424 126.0 )
( 48.10  0.71794 126.0 )
( 48.60  0.60180 126.0 )
( 49.10  0.49584 126.0 )
( 49.60  0.40007 126.0 )
( 50.10  0.31451 126.0 )
( 50.60  0.23919 126.0 )
( 51.10  0.17412 126.0 )
( 51.60  0.11933 126.0 )
( 52.10  0.07483 126.0 )
( 52.60  0.04065 126.0 )
( 53.10  0.01681 126.0 )
( 53.60  0.00332 126.0 )
( 53.90  0.00020 126.0 )
)
	spline 15 11
(
( 251.90 28.00000 0.0 )
( 251.40 28.00000 0.0 )
( 250.90 28.00000 0.0 )
( 250.40 28.00000 0.0 )
( 249.90 28.00000 0.0 )
( 249.40 28.00000 0.0 )
( 248.90 28.00000 0.0 )
( 248.40 27.98868 0.0 )
( 247.90 27.96746 0.0 )
( 247.40 27.93657 0.0 )
( 246.90 27.89440 0.0 )
( 246.40 27.83937 0.0 )
( 245.90 27.76987 0.0 )
( 245.40 27.68433 0.0 )
( 244.90 27.58114 0.0 )
( 244.40 27.45871 0.0 )
( 243.90 27.31545 0.0 )
( 243.40 27.14977 0.0 )
( 242.90 26.96007 0.0 )
( 242.40 26.74561 0.0 )
( 241.90 26.50756 0.0 )
( 241.40 26.24734 0.0 )
( 240.90 25.96636 0.0 )
( 240.40 25.66604 0.0 )
( 239.90 25.34780 0.0 )
( 239.40 25.01305 0.0 )
( 238.90 24.66321 0.0 )
( 238.40 24.29970 0.0 )
( 237.90 23.92394 0.0 )
( 237.40 23.53728 0.0 )
( 236.90 23.14096 0.0 )
( 236.40 22.73621 0.0 )
( 235.90 22.32425 0.0 )
( 235.40 21.90628 0.0 )
( 234.90 21.48354 0.0 )
( 234.40 21.05725 0.0 )
( 233.90 20.62861 0.0 )
( 233.40 20.19886 0.0 )
( 232.90 19.76921 0.0 )
( 232.40 19.34089 0.0 )
( 231.90 18.91510 0.0 )
( 231.40 18.49269 0.0 )
( 230.90 18.07361 0.0 )
( 230.40 17.65770 0.0 )
( 229.90 17.24482 0.0 )
( 229.40 16.83480 0.0 )
( 228.90 16.42749 0.0 )
( 228.40 16.02274 0.0 )
( 227.90 15.62039 0.0 )
( 227.40 15.22029 0.0 )
( 226.90 14.82227 0.0 )
( 226.40 14.42619 0.0 )
( 225.90 14.03189 0.0 )
( 225.40 13.63921 0.0 )
( 224.90 13.24800 0.0 )
( 224.40 12.85811 0.0 )
( 223.90 12.46937 0.0 )
( 223.40 12.08164 0.0 )
( 222.90 11.69475 0.0 )
( 222.40 11.30856 0.0 )
( 221.90 10.92291 0.0 )
( 221.40 10.53781 0.0 )
( 220.90 10.15370 0.0 )
( 220.40  9.77103 0.0 )
( 219.90  9.39028 0.0 )
( 219.40  9.01192 0.0 )
( 218.90  8.63643 0.0 )
( 218.40  8.26426 0.0 )
( 217.90  7.89590 0.0 )
( 217.40  7.53181 0.0 )
( 216.90  7.17247 0.0 )
( 216.40  6.81834 0.0 )
( 215.90  6.46990 0.0 )
( 215.40  6.12762 0.0 )
( 214.90  5.79196 0.0 )
( 214.40  5.46341 0.0 )
( 213.90  5.14242 0.0 )
( 213.40  4.82947 0.0 )
( 212.90  4.52503 0.0 )
( 212.40  4.22958 0.0 )
( 211.90  3.94357 0.0 )
( 211.40  3.66737 0.0 )
( 210.90  3.40101 0.0 )
( 210.40  3.14453 0.0 )
( 209.90  2.89795 0.0 )
( 209.40  2.66128 0.0 )
( 208.90  2.43454 0.0 )
( 208.40  2.21776 0.0 )
( 207.90  2.01095 0.0 )
( 207.40  1.81413 0.0 )
( 206.90  1.62733 0.0 )
( 206.40  1.45056 0.0 )
( 205.90  1.28385 0.0 )
( 205.40  1.12721 0.0 )
( 204.90  0.98067 0.0 )
( 204.40  0.84424 0.0 )
( 203.90  0.71794 0.0 )
( 203.40  0.60180 0.0 )
( 202.90  0.49584 0.0 )
( 202.40  0.40007 0.0 )
( 201.90  0.31451 0.0 )
( 201.40  0.23919 0.0 )
( 200.90  0.17412 0.0 )
( 200.40  0.11933 0.0 )
( 199.90  0.07483 0.0 )
( 199.40  0.04065 0.0 )
( 198.90  0.01681 0.0 )
( 198.40  0.00332 0.0 )
( 198.10  0.00020 0.0 )
)
	spline 14 10
(
( 251.90 28.00000 126.0 )
( 251.40 28.00000 126.0 )
( 250.90 28.00000 126.0 )
( 250.40 28.00000 126.0 )
( 249.90 28.00000 126.0 )
( 249.40 28.00000 126.0 )
( 248.90 28.00000 126.0 )
( 248.40 27.98868 126.0 )
( 247.90 27.96746 126.0 )
( 247.40 27.93657 126.0 )
( 246.90 27.89440 126.0 )
( 246.40 27.83937 126.0 )
( 245.90 27.76987 126.0 )
( 245.40 27.68433 126.0 )
( 244.90 27.58114 126.0 )
( 244.40 27.45871 126.0 )
( 243.90 27.31545 126.0 )
( 243.40 27.14977 126.0 )
( 242.90 26.96007 126.0 )
( 242.40 26.74561 126.0 )
( 241.90 26.50756 126.0 )
( 241.40 26.24734 126.0 )
( 240.90 25.96636 126.0 )
( 240.40 25.66604 126.0 )
( 239.90 25.34780 126.0 )
( 239.40 25.01305 126.0 )
( 238.90 24.66321 126.0 )
( 238.40 24.29970 126.0 )
( 237.90 23.92394 126.0 )
( 237.40 23.53728 126.0 )
( 236.90 23.14096 126.0 )
( 236.40 22.73621 126.0 )
( 235.90 22.32425 126.0 )
( 235.40 21.90628 126.0 )
( 234.90 21.48354 126.0 )
( 234.40 21.05725 126.0 )
( 233.90 20.62861 126.0 )
( 233.40 20.19886 126.0 )
( 232.90 19.76921 126.0 )
( 232.40 19.34089 126.0 )
( 231.90 18.91510 126.0 )
( 231.40 18.49269 126.0 )
( 230.90 18.07361 126.0 )
( 230.40 17.65770 126.0 )
( 229.90 17.24482 126.0 )
( 229.40 16.83480 126.0 )
( 228.90 16.42749 126.0 )
( 228.40 16.02274 126.0 )
( 227.90 15.62039 126.0 )
( 227.40 15.22029 126.0 )
( 226.90 14.82227 126.0 )
( 226.40 14.42619 126.0 )
( 225.90 14.03189 126.0 )
( 225.40 13.63921 126.0 )
( 224.90 13.24800 126.0 )
( 224.40 12.85811 126.0 )
( 223.90 12.46937 126.0 )
( 223.40 12.08164 126.0 )
( 222.90 11.69475 126.0 )
( 222.40 11.30856 126.0 )
( 221.90 10.92291 126.0 )
( 221.40 10.53781 126.0 )
( 220.90 10.15370 126.0 )
( 220.40  9.77103 126.0 )
( 219.90  9.39028 126.0 )
( 219.40  9.01192 126.0 )
( 218.90  8.63643 126.0 )
( 218.40  8.26426 126.0 )
( 217.90  7.89590 126.0 )
( 217.40  7.53181 126.0 )
( 216.90  7.17247 126.0 )
( 216.40  6.81834 126.0 )
( 215.90  6.46990 126.0 )
( 215.40  6.12762 126.0 )
( 214.90  5.79196 126.0 )
( 214.40  5.46341 126.0 )
( 213.90  5.14242 126.0 )
( 213.40  4.82947 126.0 )
( 212.90  4.52503 126.0 )
( 212.40  4.22958 126.0 )
( 211.90  3.94357 126.0 )
( 211.40  3.66737 126.0 )
( 210.90  3.40101 126.0 )
( 210.40  3.14453 126.0 )
( 209.90  2.89795 126.0 )
( 209.40  2.66128 126.0 )
( 208.90  2.43454 126.0 )
( 208.40  2.21776 126.0 )
( 207.90  2.01095 126.0 )
( 207.40  1.81413 126.0 )
( 206.90  1.62733 126.0 )
( 206.40  1.45056 126.0 )
( 205.90  1.28385 126.0 )
( 205.40  1.12721 126.0 )
( 204.90  0.98067 126.0 )
( 204.40  0.84424 126.0 )
( 203.90  0.71794 126.0 )
( 203.40  0.60180 126.0 )
( 202.90  0.49584 126.0 )
( 202.40  0.40007 126.0 )
( 201.90  0.31451 126.0 )
( 201.40  0.23919 126.0 )
( 200.90  0.17412 126.0 )
( 200.40  0.11933 126.0 )
( 199.90  0.07483 126.0 )
( 199.40  0.04065 126.0 )
( 198.90  0.01681 126.0 )
( 198.40  0.00332 126.0 )
( 198.00  0.00000 126.0 )
)
);

blocks
(
	hex (0 1 17 16 4 5 18 19)   // vertex numbers 
	(21 119 1)		// numbers of cells in each direction
	simpleGrading (1 1815 1)	// cell expansion ratios 

	hex (16 17 2 3 19 18 6 7)   // vertex numbers 
	(21 30 1)		// numbers of cells in each direction
	simpleGrading (1 0.5 1)	// cell expansion ratios 

	hex (1 11 20 17 5 10 21 18)
	(57 119 1)
	simpleGrading (1 1815 1)

	hex (17 20 8 2 18 21 9 6)
	(57 30 1)
	simpleGrading (1 0.5 1)

	hex (11 15 22 20 10 14 23 21)
	(21 119 1)
	simpleGrading (1 1815 1)

	hex (20 22 12 8 21 23 13 9)
	(21 30 1)
	simpleGrading (1 0.5 1)
);

boundary
(
	inlet
	{
		type	cyclic;
		matchTolerance 1e-4;
		neighbourPatch	outlet;
		faces
		(
			(0 4 19 16)
			(16 19 7 3)
		);
	}
	outlet
	{
		type	cyclic;
		matchTolerance 1e-4;
		neighbourPatch inlet;
		faces
		(
			(22 23 14 15)
			(12 13 23 22)
		);
	}
	topWall
	{
		type	wall;
		faces
		(
			(3 7 6 2)
			(2 6 9 8)
			(8 9 13 12)
		);
	}
	bottomWall
	{
		type	wall;
		faces
		(
			(0 1 5 4)
			(1 11 10 5)
			(11 15 14 10)
		);
	}
	defaultFaces
	{
		type	empty;
		faces
		(
			(4 5 18 19)
			(19 18 6 7)
			(5 10 21 18)
			(18 21 9 6)
			(10 14 23 21)
			(21 23 13 9)
			(0 16 17 1)
			(16 3 2 17)
			(1 17 20 11)
			(17 2 8 20)
			(11 20 22 15)
			(20 8 12 22)
		);
	}
);
